__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_11 (InputLayer)           (None, 512, 512, 1)  0                                            
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 512, 512, 16) 416         input_11[0][0]                   
__________________________________________________________________________________________________
reshape_12 (Reshape)            (None, 512, 512, 1,  0           conv1[0][0]                      
__________________________________________________________________________________________________
primarycaps (ConvCapsuleLayer)  (None, 256, 256, 2,  12832       reshape_12[0][0]                 
__________________________________________________________________________________________________
conv_cap_2_1 (ConvCapsuleLayer) (None, 256, 256, 4,  25664       primarycaps[0][0]                
__________________________________________________________________________________________________
conv_cap_2_2 (ConvCapsuleLayer) (None, 128, 128, 4,  51328       conv_cap_2_1[0][0]               
__________________________________________________________________________________________________
conv_cap_3_1 (ConvCapsuleLayer) (None, 128, 128, 8,  205056      conv_cap_2_2[0][0]               
__________________________________________________________________________________________________
conv_cap_3_2 (ConvCapsuleLayer) (None, 64, 64, 8, 64 410112      conv_cap_3_1[0][0]               
__________________________________________________________________________________________________
conv_cap_4_1 (ConvCapsuleLayer) (None, 64, 64, 8, 32 409856      conv_cap_3_2[0][0]               
__________________________________________________________________________________________________
deconv_cap_1_1 (DeconvCapsuleLa (None, 128, 128, 8,  131328      conv_cap_4_1[0][0]               
__________________________________________________________________________________________________
up_1 (Concatenate)              (None, 128, 128, 16, 0           deconv_cap_1_1[0][0]             
                                                                 conv_cap_3_1[0][0]               
__________________________________________________________________________________________________
deconv_cap_1_2 (ConvCapsuleLaye (None, 128, 128, 4,  102528      up_1[0][0]                       
__________________________________________________________________________________________________
deconv_cap_2_1 (DeconvCapsuleLa (None, 256, 256, 4,  32832       deconv_cap_1_2[0][0]             
__________________________________________________________________________________________________
up_2 (Concatenate)              (None, 256, 256, 8,  0           deconv_cap_2_1[0][0]             
                                                                 conv_cap_2_1[0][0]               
__________________________________________________________________________________________________
deconv_cap_2_2 (ConvCapsuleLaye (None, 256, 256, 4,  25664       up_2[0][0]                       
__________________________________________________________________________________________________
deconv_cap_3_1 (DeconvCapsuleLa (None, 512, 512, 2,  8224        deconv_cap_2_2[0][0]             
__________________________________________________________________________________________________
up_3 (Concatenate)              (None, 512, 512, 3,  0           deconv_cap_3_1[0][0]             
                                                                 reshape_12[0][0]                 
__________________________________________________________________________________________________
seg_caps (ConvCapsuleLayer)     (None, 512, 512, 1,  272         up_3[0][0]                       
__________________________________________________________________________________________________
input_12 (InputLayer)           (None, 512, 512, 1)  0                                            
__________________________________________________________________________________________________
mask_4 (Mask)                   (None, 512, 512, 1,  0           seg_caps[0][0]                   
                                                                 input_12[0][0]                   
__________________________________________________________________________________________________
reshape_13 (Reshape)            (None, 512, 512, 16) 0           mask_4[0][0]                     
__________________________________________________________________________________________________
recon_1 (Conv2D)                (None, 512, 512, 64) 1088        reshape_13[0][0]                 
__________________________________________________________________________________________________
recon_2 (Conv2D)                (None, 512, 512, 128 8320        recon_1[0][0]                    
__________________________________________________________________________________________________
out_seg (Length)                (None, 512, 512, 1)  0           seg_caps[0][0]                   
__________________________________________________________________________________________________
out_recon (Conv2D)              (None, 512, 512, 1)  129         recon_2[0][0]                    
==================================================================================================
Total params: 1,425,649
Trainable params: 1,425,649
Non-trainable params: 0
__________________________________________________________________________________________________
